# Pandas Python Tutorial

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 ={
"name":["Piyush","Aryan","Mukesh"],
 "marks":[99,98,89],
  "city":["Aburoad","Akara Bhatta" ,"AamThala"]  
}

In [3]:
dict1

{'name': ['Piyush', 'Aryan', 'Mukesh'],
 'marks': [99, 98, 89],
 'city': ['Aburoad', 'Akara Bhatta', 'AamThala']}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks          city
0  Piyush     99       Aburoad
1   Aryan     98  Akara Bhatta
2  Mukesh     89      AamThala

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_wi.csv',index=False)

In [8]:
df.head(2)

     name  marks          city
0  Piyush     99       Aburoad
1   Aryan     98  Akara Bhatta

In [9]:
df.tail(2)

     name  marks          city
1   Aryan     98  Akara Bhatta
2  Mukesh     89      AamThala

In [10]:
df.describe()

           marks
count   3.000000
mean   95.333333
std     5.507571
min    89.000000
25%    93.500000
50%    98.000000
75%    98.500000
max    99.000000

In [11]:
piyush = pd.read_csv('piyush.csv')

In [12]:
piyush

   Train No  Speed       City
0     12916    100      Delhi
1     12915    110  Ahemdabad
2     12216    130    Aburoad
3     22824     90     Jaipur

In [14]:
piyush['Speed']

0    100
1    110
2    130
3     90
Name: Speed, dtype: int64

In [15]:
piyush['Speed'][0]

np.int64(100)

In [18]:
 piyush['Train No']

0    12916
1    12915
2    12216
3    22824
Name: Train No, dtype: int64

In [19]:
piyush

   Train No  Speed       City
0     12916    100      Delhi
1     12915    110  Ahemdabad
2     12216    130    Aburoad
3     22824     90     Jaipur

In [22]:
ser = pd.Series(np.random.rand(34))

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
newdf = pd.DataFrame(np.random.rand(334,5),index =np.arange(334))

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [30]:
newdf.head()

          0         1         2         3         4
0  0.643584  0.956249  0.618284  0.608444  0.566489
1  0.733307  0.355573  0.400758  0.883541  0.449566
2  0.454182  0.253709  0.222754  0.139876  0.906354
3  0.773989  0.438137  0.393879  0.487779  0.517853
4  0.548473  0.009330  0.728241  0.969687  0.333542

In [31]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [33]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
newdf.to_numpy()

array([[0.64358419, 0.95624855, 0.61828391, 0.60844449, 0.56648872],
       [0.73330731, 0.35557276, 0.40075764, 0.88354077, 0.44956604],
       [0.45418182, 0.25370941, 0.22275421, 0.13987612, 0.90635362],
       ...,
       [0.03866225, 0.73736443, 0.60343553, 0.49009566, 0.66755861],
       [0.33144711, 0.70221769, 0.55746699, 0.01436608, 0.37744097],
       [0.41659103, 0.64706154, 0.20692798, 0.27040093, 0.42122904]],
      shape=(334, 5))

In [35]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.643584,0.733307,0.454182,0.773989,0.548473,0.682397,0.672633,0.392404,0.767708,0.388768,...,0.869463,0.547787,0.913969,0.813301,0.879015,0.220813,0.283522,0.038662,0.331447,0.416591
1,0.956249,0.355573,0.253709,0.438137,0.009330,0.708709,0.940386,0.394191,0.966148,0.789019,...,0.863864,0.857372,0.922684,0.958405,0.519127,0.864768,0.778651,0.737364,0.702218,0.647062
2,0.618284,0.400758,0.222754,0.393879,0.728241,0.465243,0.975619,0.414685,0.326353,0.700967,...,0.280965,0.212173,0.658561,0.596871,0.982042,0.864632,0.770811,0.603436,0.557467,0.206928
3,0.608444,0.883541,0.139876,0.487779,0.969687,0.589900,0.262364,0.522317,0.942281,0.883522,...,0.738678,0.164967,0.623461,0.541365,0.258992,0.502435,0.264824,0.490096,0.014366,0.270401
4,0.566489,0.449566,0.906354,0.517853,0.333542,0.919079,0.855970,0.788810,0.792328,0.005853,...,0.436627,0.718404,0.808013,0.770198,0.966800,0.755793,0.605251,0.667559,0.377441,0.421229

In [37]:
newdf.head()

          0         1         2         3         4
0  0.643584  0.956249  0.618284  0.608444  0.566489
1  0.733307  0.355573  0.400758  0.883541  0.449566
2  0.454182  0.253709  0.222754  0.139876  0.906354
3  0.773989  0.438137  0.393879  0.487779  0.517853
4  0.548473  0.009330  0.728241  0.969687  0.333542

In [38]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.416591  0.647062  0.206928  0.270401  0.421229
332  0.331447  0.702218  0.557467  0.014366  0.377441
331  0.038662  0.737364  0.603436  0.490096  0.667559
330  0.283522  0.778651  0.770811  0.264824  0.605251
329  0.220813  0.864768  0.864632  0.502435  0.755793
..        ...       ...       ...       ...       ...
4    0.548473  0.009330  0.728241  0.969687  0.333542
3    0.773989  0.438137  0.393879  0.487779  0.517853
2    0.454182  0.253709  0.222754  0.139876  0.906354
1    0.733307  0.355573  0.400758  0.883541  0.449566
0    0.643584  0.956249  0.618284  0.608444  0.566489

[334 rows x 5 columns]

In [39]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.566489  0.608444  0.618284  0.956249  0.643584
1    0.449566  0.883541  0.400758  0.355573  0.733307
2    0.906354  0.139876  0.222754  0.253709  0.454182
3    0.517853  0.487779  0.393879  0.438137  0.773989
4    0.333542  0.969687  0.728241  0.009330  0.548473
..        ...       ...       ...       ...       ...
329  0.755793  0.502435  0.864632  0.864768  0.220813
330  0.605251  0.264824  0.770811  0.778651  0.283522
331  0.667559  0.490096  0.603436  0.737364  0.038662
332  0.377441  0.014366  0.557467  0.702218  0.331447
333  0.421229  0.270401  0.206928  0.647062  0.416591

[334 rows x 5 columns]

In [2]:
import numpy as np
import pandas as pd
newdf = pd.DataFrame(np.random.rand(334,5),index =np.arange(334))

In [3]:
newdf.head()

          0         1         2         3         4
0  0.417927  0.838661  0.664228  0.937997  0.128909
1  0.332782  0.122433  0.887576  0.521448  0.083257
2  0.462839  0.232664  0.018682  0.919656  0.723526
3  0.609358  0.753715  0.516503  0.814999  0.232920
4  0.784992  0.462757  0.331334  0.779424  0.489974

In [4]:
newdf.columns = list("ABCDE")

In [5]:
newdf

            A         B         C         D         E
0    0.417927  0.838661  0.664228  0.937997  0.128909
1    0.332782  0.122433  0.887576  0.521448  0.083257
2    0.462839  0.232664  0.018682  0.919656  0.723526
3    0.609358  0.753715  0.516503  0.814999  0.232920
4    0.784992  0.462757  0.331334  0.779424  0.489974
..        ...       ...       ...       ...       ...
329  0.846878  0.539694  0.692526  0.796096  0.963132
330  0.993157  0.651072  0.715881  0.367350  0.789568
331  0.645342  0.469989  0.537728  0.882438  0.142323
332  0.573371  0.927044  0.307886  0.950938  0.544636
333  0.619195  0.223146  0.264312  0.723558  0.145590

[334 rows x 5 columns]

In [6]:
newdf.head()

          A         B         C         D         E
0  0.417927  0.838661  0.664228  0.937997  0.128909
1  0.332782  0.122433  0.887576  0.521448  0.083257
2  0.462839  0.232664  0.018682  0.919656  0.723526
3  0.609358  0.753715  0.516503  0.814999  0.232920
4  0.784992  0.462757  0.331334  0.779424  0.489974

In [7]:
newdf.loc[0,'A']

np.float64(0.41792684904317423)

In [8]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.887576  0.521448
2  0.018682  0.919656

In [9]:
newdf.head()

          A         B         C         D         E
0  0.417927  0.838661  0.664228  0.937997  0.128909
1  0.332782  0.122433  0.887576  0.521448  0.083257
2  0.462839  0.232664  0.018682  0.919656  0.723526
3  0.609358  0.753715  0.516503  0.814999  0.232920
4  0.784992  0.462757  0.331334  0.779424  0.489974

In [10]:
newdf.loc[[0],:]

          A         B         C         D         E
0  0.417927  0.838661  0.664228  0.937997  0.128909

In [11]:
newdf.loc[:,['A',"B"]]

            A         B
0    0.417927  0.838661
1    0.332782  0.122433
2    0.462839  0.232664
3    0.609358  0.753715
4    0.784992  0.462757
..        ...       ...
329  0.846878  0.539694
330  0.993157  0.651072
331  0.645342  0.469989
332  0.573371  0.927044
333  0.619195  0.223146

[334 rows x 2 columns]

In [13]:
newdf.loc[newdf['A']<0.3]

            A         B         C         D         E
7    0.272253  0.447703  0.703188  0.742028  0.635235
12   0.041724  0.811145  0.845752  0.142423  0.653797
17   0.111961  0.192879  0.799081  0.965966  0.583677
19   0.073151  0.224264  0.645191  0.953747  0.269053
21   0.070252  0.920655  0.046639  0.632516  0.407361
..        ...       ...       ...       ...       ...
311  0.275163  0.993613  0.643445  0.370128  0.059488
313  0.060573  0.512861  0.550075  0.039944  0.720906
314  0.298110  0.536270  0.475779  0.552089  0.600591
322  0.210094  0.389873  0.746077  0.774302  0.959149
326  0.146239  0.991504  0.237575  0.018820  0.928510

[100 rows x 5 columns]

In [14]:
newdf.head()

          A         B         C         D         E
0  0.417927  0.838661  0.664228  0.937997  0.128909
1  0.332782  0.122433  0.887576  0.521448  0.083257
2  0.462839  0.232664  0.018682  0.919656  0.723526
3  0.609358  0.753715  0.516503  0.814999  0.232920
4  0.784992  0.462757  0.331334  0.779424  0.489974

In [15]:
df=pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [16]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [17]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [22]:
df.dropna(how='any',axis=0)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [24]:
df_s = pd.DataFrame([[0,1],[2,3],[6,8]])

In [26]:
df_s

   0  1
0  0  1
1  2  3
2  6  8

In [30]:
df_s.describe()

              0         1
count  3.000000  3.000000
mean   2.666667  4.000000
std    3.055050  3.605551
min    0.000000  1.000000
25%    1.000000  2.000000
50%    2.000000  3.000000
75%    4.000000  5.500000
max    6.000000  8.000000

In [34]:
df_s.mean()

0    2.666667
1    4.000000
dtype: float64

In [35]:
df_s.corr()

          0         1
0  1.000000  0.998625
1  0.998625  1.000000

In [36]:
df_s.count()

0    3
1    3
dtype: int64

In [37]:
df_s.max()
df_s.min()

0    0
1    1
dtype: int64

In [40]:
df_s.median(axis=0)

0    2.0
1    3.0
dtype: float64

In [43]:
df_s.std(axis=1)

0    0.707107
1    0.707107
2    1.414214
dtype: float64